cf/Catalogs/ПодарочныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодарочныеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Номинал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОткудаПришел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументАктивации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ПодарочныеКарты_Номинал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПодарочныеКарты_Номинал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>н500</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н1000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н3000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н5000</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н10000</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ПодарочныеКарты_Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПодарочныеКарты_Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ПодарочныеКарты/Forms/ФормаАктивацииМаркетологом/Ext/Form/Module.bsl
&НаСервере
Процедура АктивироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодарочныеКарты.Ссылка,
	               |	ПодарочныеКарты.СтатусКарты,
	               |	ПодарочныеКарты.Наименование
	               |ИЗ
	               |	Справочник.ПодарочныеКарты КАК ПодарочныеКарты
	               |ГДЕ
	               |	ПодарочныеКарты.Номинал = &Номинал
	               |	И ПодарочныеКарты.ПорядковыйНомер МЕЖДУ &НомерНачала И &НомерКонца";
	Запрос.УстановитьПараметр("Номинал",Перечисления.ПодарочныеКарты_Номинал.н500);
	Запрос.УстановитьПараметр("НомерНачала",от);
	Запрос.УстановитьПараметр("НомерКонца",до);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.СтатусКарты <> Перечисления.ПодарочныеКарты_Статус.Создана Тогда
			Сообщить("Карту "+Результат.Наименование+" нельзя активировать, т.к. её статус: "+Результат.СтатусКарты);
		КонецЕсли;
		ТекОбъект = Результат.Ссылка.ПолучитьОбъект();
		ТекОбъект.СтатусКарты = Перечисления.ПодарочныеКарты_Статус.Активирована;
		ТекОбъект.ДатаАктивации = ТекущаяДата();
		ТекОбъект.МестоАктивации = МестоАктивации;
		ТекОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Активировать(Команда)
	Если от=0 или до=0 или МестоАктивации.Пустая() Тогда
		ПоказатьПредупреждение(,"Все поля обязательны для заполнения");
		Возврат;
	КонецЕсли;
	АктивироватьНаСервере();
КонецПроцедуры
